Revit 2024 API
Water.WaterType Property
 The property labeled "Type" from the "Water" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WaterType { get; }
Visual Basic
Public Shared ReadOnly Property WaterType As String
	Get
Visual C++
public:
static property String^ WaterType {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WaterType".
See Also
Water Class
Autodesk.Revit.DB.Visual Namespace